<?php  if (!defined('BASEPATH')) exit('No direct script access allowed');
/**
 * CodeIgniter
 *
 * An open source application development framework for PHP 4.3.2 or newer
 *
 * @package		CodeIgniter
 * @copyright	Copyright (c) 2006, EllisLab, Inc.
 * @since		Version 1.0
 * @filesource
 */

// ------------------------------------------------------------------------

/**
 * Removed sign
 *
 *
 * @access	public
 * @param	string
 * @return	string
 */
if (! function_exists('removed_sign'))
{
	function removed_sign($str)
	{
		if(empty($str)) return $str;
		$char_unicode = array(  
					'ạ','á','à','ả','ã','Ạ','Á','À','Ả','Ã',  
					'â','ậ','ấ','ầ','ẩ','ẫ','Â','Ậ','Ấ','Ầ','Ẩ','Ẫ',  
					'ă','ặ','ắ','ằ','ẳ','ẫ','Ă','Ắ','Ằ','Ẳ','Ẵ','Ặ',  
					'ê','ẹ','é','è','ẻ','ẽ','Ê','Ẹ','É','È','Ẻ','Ẽ',  
					'ế','ề','ể','ễ','ệ','Ế','Ề','Ể','Ễ','Ệ',  
					'ọ','ộ','ổ','ỗ','ố','ồ','Ọ','Ộ','Ổ','Ỗ','Ố','Ồ','Ô','ô',  
					'ó','ò','ỏ','õ','Ó','Ò','Ỏ','Õ',  
					'ơ','ợ','ớ','ờ','ở','ỡ',  
					'Ơ','Ợ','Ớ','Ờ','Ở','Ỡ',  
					'ụ','ư','ứ','ừ','ử','ữ','Ụ','Ư','Ứ','Ừ','Ử','Ữ','ự','Ự',  
					'ú','ù','ủ','ũ','Ú','Ù','Ủ','Ũ',  
					'ị','í','ì','ỉ','ĩ','Ị','Í','Ì','Ỉ','Ĩ',  
					'ỵ','ý','ỳ','ỷ','ỹ','Ỵ','Ý','Ỳ','Ỷ','Ỹ',  
					'đ','Đ' 
		);  

		$char_EN = array(  
					'a','a','a','a','a','A','A','A','A','A',  
					'a','a','a','a','a','a','A','A','A','A','A','A',  
					'a','a','a','a','a','a','A','A','A','A','A','A',  
					'e','e','e','e','e','e','E','E','E','E','E','E',  
					'e','e','e','e','e','E','E','E','E','E',  
					'o','o','o','o','o','o','O','O','O','O','O','O','O','o',  
					'o','o','o','o','O','O','O','O',  
					'o','o','o','o','o','o',  
					'O','O','O','O','O','O',  
					'u','u','u','u','u','u','U','U','U','U','U','U','u','U',  
					'u','u','u','u','U','U','U','U',  
					'i','i','i','i','i','I','I','I','I','I',  
					'y','y','y','y','y','Y','Y','Y','Y','Y',  
					'd','D'  
		); 
			 
		$char_unknow = array(  
					'ạ','&aacute;','&agrave;','ả','&atilde;','Ạ','&Aacute;','&Agrave;','Ả','&Atilde;',  
					'&acirc;','ậ','ấ','ầ','ẩ','ẫ','&Acirc;','Ậ','Ấ','Ầ','Ẩ','Ẫ',  
					'ă','ặ','ắ','ằ','ẳ','ẫ','Ă','Ắ','Ằ','Ẳ','Ẵ','Ặ',  
					'&ecirc;','ẹ','&eacute;','&egrave;','ẻ','ẽ','&Ecirc;','Ẹ','&Eacute;','&Egrave;','Ẻ','Ẽ',  
					'ế','ề','ể','ễ','&#7879;','Ế','Ề','Ể','Ễ','Ệ',  
					'ọ','ộ','ổ','ỗ','ố','ồ','Ọ','Ộ','Ổ','Ỗ','Ố','Ồ','&Ocirc;','&ocirc;',  
					'&oacute;','&ograve;','ỏ','&otilde;','&Oacute;','&Ograve;','Ỏ','&Otilde;',  
					'ơ','ợ','ớ','&#7901;','ở','ỡ',  
					'Ơ','Ợ','Ớ','Ờ','Ở','Ỡ',  
					'ụ','ư','ứ','ừ','ử','ữ','Ụ','Ư','Ứ','Ừ','Ử','Ữ','ự','Ự',  
					'&uacute;','&ugrave;','ủ','ũ','&Uacute;','&Ugrave;','Ủ','Ũ',  
					'ị','&iacute;','&igrave;','ỉ','ĩ','Ị','&Iacute;','&Igrave;','Ỉ','Ĩ',  
					'ỵ','&yacute;','ỳ','ỷ','ỹ','Ỵ','&Yacute;','Ỳ','Ỷ','Ỹ',  
					'đ','Đ'  
		); 

		$char_html = array(  
					'&#7841;','á','à','&#7843;','ã','Ạ','Á','À','Ả','Ã',  
					'â','ậ','ấ','&#7847;','&#7849;','ẫ','Â','Ậ','Ấ','Ầ','Ẩ','Ẫ',  
					'ă','ặ','&#7855;','ằ','ẳ','ẫ','Ă','Ắ','Ằ','Ẳ','Ẵ','Ặ',  
					'ê','&#7865;','é','è','ẻ','ẽ','Ê','Ẹ','É','È','Ẻ','Ẽ',  
					'&#7871;','ề','ể','ễ','ệ','Ế','Ề','Ể','Ễ','Ệ',  
					'ọ','&#7897;','ổ','ỗ','&#7889;','&#7891;','Ọ','Ộ','Ổ','Ỗ','Ố','Ồ','Ô','ô',  
					'ó','ò','ỏ','õ','Ó','Ò','Ỏ','Õ',  
					'&#417;','ợ','&#7899;','&#7901;','&#7903;','ỡ',  
					'Ơ','Ợ','Ớ','Ờ','Ở','Ỡ',  
					'&#7909;','&#432;','ứ','ừ','ử','&#7919;','Ụ','Ư','Ứ','Ừ','Ử','Ữ','ự','Ự',  
					'ú','ù','ủ','ũ','Ú','Ù','Ủ','Ũ',  
					'ị','í','ì','ỉ','ĩ','Ị','Í','Ì','Ỉ','Ĩ',  
					'ỵ','ý','ỳ','ỷ','ỹ','Ỵ','Ý','Ỳ','Ỷ','Ỹ',  
					'&#273;','&#272;'  
		); 
		 
		$char_viqr = array(  
			'a.',"a'",'a`','a?','a~','A.',"A'",'A`','A?','A~',  
			'a^','a^.',"a^'",'a^`','a^?','a^~','A^','A^.',"A^'",'A^`','A^?','A^~',  
			'a(','a(.',"a('",'a(`','a(?','a^~','A(',"A('",'A(`','A(?','A(~','A(.',  
			'e^','e.',"e'",'e`','e?','e~','E^','E.',"E'",'E`','E?','E~',  
			"e^'",'e^`','e^?','e^~','e^.',"E^'",'E^`','E^?','E^~','E^.',  
			'o.','o^.','o^?','o^~',"o^'",'o^`','O.','O^.','O^?','O^~',"O^'",'O^`','O^','o^',  
			"o'",'o`','o?','o~',"O'",'O`','O?','O~',  
			'o+','o+.',"o+'",'o+`','o+?','o+~',  
			'O+','O+.',"O+'",'O+`','O+?','O+~',  
			'u.','u+',"u+'",'u+`','u+?','u+~','U.','U+',"U+'",'U+`','U+?','U+~','u+.','U+.',  
			"u'",'u`','u?','u~',"U'",'U`','U?','U~',  
			'i.',"i'",'i`','i?','i~','I.',"I'",'I`','I?','I~',  
			'y.',"y'",'y`','y?','y~','Y.',"Y'",'Y`','Y?','Y~',  
			'dd','DD'  
		);  

		$char_iso = array(  
			'ạ','á','à','&#7843;','ã','Ạ','Á','À','Ả','Ã',  
			'â','ậ','ấ','ầ','ẩ','ẫ','Â','Ậ','Ấ','Ầ','Ẩ','Ẫ',  
			'ă','ặ','ắ','ằ','ẳ','ẫ','Ă','Ắ','Ằ','Ẳ','Ẵ','Ặ',  
			'ê','ẹ','é','è','ẻ','ẽ','Ê','Ẹ','É','È','Ẻ','Ẽ',  
			'ế','ề','ể','ễ','ệ','Ế','Ề','Ể','Ễ','Ệ',  
			'ọ','ộ','ổ','ỗ','ố','ồ','Ọ','Ộ','Ổ','Ỗ','Ố','Ồ','Ô','ô',  
			'ó','ò','ỏ','õ','Ố','Ô','Ỏ','Õ',  
			'ơ','ợ','ớ','ờ','ở','ỡ',  
			'Ơ','Ợ','Ớ','Ờ','Ở','Ỡ',  
			'ụ','ư','ứ','ừ','ử','ữ','Ụ','Ư','Ứ','Ừ','Ử','Ữ','ự','Ự',  
			'ú','ù','ủ','ũ','Ú','Ù','Ủ','Ũ',  
			'ị','í','ì','ỉ','ĩ','Ị','Í','Ì','Ỉ','Ĩ',  
			'ỵ','ý','ỳ','ỷ','ỹ','Ỵ','Ý','Ỳ','Ỷ','Ỹ',  
			'đ','Đ'  
		);  
		
		$str = htmlspecialchars_decode($str);
		$str = str_replace($char_unicode,$char_EN,$str);
		$str = str_replace($char_viqr,$char_EN,$str);
		$str = str_replace($char_iso,$char_EN,$str);
		$str = str_replace($char_unknow,$char_EN,$str);
		$str = str_replace($char_html,$char_EN,$str);
		return $str;
	}
}

/* End of file array_helper.php */
/* Location: ./system/helpers/array_helper.php */